FCGI  -*- mode: org; fill-column: 82 -*-
#+CATEGORY: fcgi.rkt
#+STARTUP: content
#+seq_todo: TODO STARTED(s/@) WAITING(w@/@) DELEGATED(l@/@) APPT | DONE(d@/@) DEFERRED(f@/@) CANCELLED(x@/@) IDEA(i/@)
#+TAGS: { SCHOOL(s) BLOG(b) TIL(t) }
#+PROPERTY: Effort_ALL 0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00
#+COLUMNS: %30ITEM(Task) %CLOCKSUM %15Effort(Effort){:}

** DONE Gracefully handle TCP connection closure
CLOSED: [2019-06-21 Fri 12:02]
- State "DONE"       from "STARTED"    [2019-06-21 Fri 12:02] \\
  That was tricky - concurrency programming is hard. Appears that Nginx expects us
  to close the connection to signal that request has been handled. Only after that
  does it communcate back to the client. I think its just wrong. For now I close TCP
  on our end, but going forward maybe worth checking connection.multiplex? and close
  TCP if unset, loop if set. Naturally, the default should probably be unset and we
  toggle it for webservers that support it (I assume here that such ws would
  communicate this via management records).
- State "TODO"       from "STARTED"    [2019-06-21 Fri 10:24]
:LOGBOOK:
CLOCK: [2019-06-21 Fri 10:27]--[2019-06-21 Fri 12:02] =>  1:35
CLOCK: [2019-06-21 Fri 10:00]--[2019-06-21 Fri 10:24] =>  0:24
:END:

Some check needed somewhere before we attempt to do IO on the TCP connection.
Appears Nginx immediately closes it having received FCGI repsonse.

** DONE Listen and receive FCGI connections
CLOSED: [2019-06-15 Sat 17:07]
- State "DONE"       from "TODO"       [2019-06-15 Sat 17:07]
- State "TODO"       from "STARTED"    [2019-06-15 Sat 15:20] \\
  Need to sort out tables.rkt first
:LOGBOOK:
CLOCK: [2019-06-15 Sat 14:42]--[2019-06-15 Sat 15:20] =>  0:38
:END:

** DONE Parse <params>
CLOSED: [2019-06-16 Sun 14:07]
- State "DONE"       from "TODO"       [2019-06-16 Sun 14:07]
- State "TODO"       from "STARTED"    [2019-06-16 Sun 12:14]
:LOGBOOK:
CLOCK: [2019-06-16 Sun 11:32]--[2019-06-16 Sun 12:14] =>  0:42
:END:
** DONE How and when to break the reader loop
CLOSED: [2019-06-19 Wed 14:29]
- State "DONE"       from "STARTED"    [2019-06-19 Wed 14:29]
:LOGBOOK:
CLOCK: [2019-06-19 Wed 11:41]--[2019-06-19 Wed 14:29] =>  2:48
:END:

Having received <stdin> there isn't much for the loop to do unless we'are
multiplexing records on the same connection. Without multiplexing the loop needs
to stop, with multiplexing it may continuen to parse and deliver records.

Freaking multiplexing strikes again. Request per connection would be so much
easier. Why do I even bother? Do webservers actually support full multiplexing?

** DONE <end-request>
CLOSED: [2019-06-20 Thu 11:50]
- State "DONE"       from "TODO"       [2019-06-20 Thu 11:50] \\
  <end-request>:pack is actually fine. Best I can tell I had a race where
  <end-request> would get sent before <stdout> stream's been closed so Nginx
  state-machine would essentially receive records out of order. That kinda tells you
  that FastCGI protocl itself sucks badly: it is underspecified and has all sorts of
  possible races with no clear strategy to prevent them. So what implementations do?
  They effectively come up with a state machine that imposes record ordering. Tough
  luck if your FCGI client doesn't follow that order. FCGI is a bad protocol.
- State "TODO"       from "STARTED"    [2019-06-19 Wed 17:23] \\
  Looks like <end-request>:pack produces malformed record. Nginx reports unexpected
  record type or something like that. Either that, or Nginx FastCGI doesn't expect
  to receive <end-request> at all, so that type of message doesn't even exist from
  its perspective?
:LOGBOOK:
CLOCK: [2019-06-19 Wed 15:58]--[2019-06-19 Wed 17:23] =>  1:25
:END:
